In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
df = pd.read_csv('hiring.csv')
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [3]:
df['test_score(out of 10)'] = df['test_score(out of 10)'].fillna(df['test_score(out of 10)'].median())
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    8.0                           7      72000
7     eleven                    7.0                           8      80000

In [4]:
#df['experience'].str.contains('seven')
'nine' in df.experience.values

False

In [5]:
pd.isnull(df).sum()

experience                    2
test_score(out of 10)         0
interview_score(out of 10)    0
salary($)                     0
dtype: int64

In [6]:
exp_int = [i for i in range(1,12)]
exp_str = ['one','two','three', 'four','five','six','seven','eight','nine','ten','eleven']
#USING DICT COMPREHENSION TO BUILD A 
exp_dict = {k:v for k,v in zip(exp_str,exp_int)}
exp_dict

{'one': 1,
 'two': 2,
 'three': 3,
 'four': 4,
 'five': 5,
 'six': 6,
 'seven': 7,
 'eight': 8,
 'nine': 9,
 'ten': 10,
 'eleven': 11}

In [7]:
for i in range(len(df)):
    for k,v in exp_dict.items():
        if k in df.experience.values:
            df["experience"].replace({k: v}, inplace=True)
        else:
            pass
df

C:\Users\PETER PURCHASE DEPT\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: FutureWarning: elementwise comparison failed; returning scalar instead, but in the future will perform elementwise comparison
  This is separate from the ipykernel package so we can avoid doing imports until

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0         NaN                    8.0                           9      50000
1         NaN                    8.0                           6      45000
2         5.0                    6.0                           7      60000
3         2.0                   10.0                          10      65000
4         7.0                    9.0                           6      70000
5         3.0                    7.0                          10      62000
6        10.0                    8.0                           7      72000
7        11.0                    7.0                           8      80000

In [8]:
df.experience = df.experience.fillna(0)
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0         0.0                    8.0                           9      50000
1         0.0                    8.0                           6      45000
2         5.0                    6.0                           7      60000
3         2.0                   10.0                          10      65000
4         7.0                    9.0                           6      70000
5         3.0                    7.0                          10      62000
6        10.0                    8.0                           7      72000
7        11.0                    7.0                           8      80000

In [9]:
train = df.drop(['salary($)'], axis=1)
train

   experience  test_score(out of 10)  interview_score(out of 10)
0         0.0                    8.0                           9
1         0.0                    8.0                           6
2         5.0                    6.0                           7
3         2.0                   10.0                          10
4         7.0                    9.0                           6
5         3.0                    7.0                          10
6        10.0                    8.0                           7
7        11.0                    7.0                           8

In [10]:
from sklearn import linear_model

In [11]:
reg = linear_model.LinearRegression()

In [12]:
reg.fit(train, df['salary($)'])

LinearRegression()

In [14]:
app1 = np.array([2,9,6])
pred1 = reg.predict([app1])
print(f"For an applicant with {app1[0]} years, a test score of {app1[1]} and an interview score of {app1[2]}, the salary will be $ {float(pred1):.2f}")

For an applicant with 2 years, a test score of 9 and an interview score of 6, the salary will be $ 53205.97

In [15]:
app2 = np.array([12,10,10])
pred2 = reg.predict([app2])
print(f"For an applicant with {app2[0]} years, a test score of {app2[1]} and an interview score of {app2[2]}, the salary will be $ {float(pred2):.2f}")

For an applicant with 12 years, a test score of 10 and an interview score of 10, the salary will be $ 92002.18